manoj153/STM32F1BOARD/Src/main.c
  /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USART2 init function */
static void MX_USART2_UART_Init(void)
{

  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOE, CH6R_2_Pin|CH6R_3_Pin|CH6R_4_Pin|CH1R_2_Pin 
                          |CH1R_1_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, RTS_Pin|CH1G_1_Pin|CONN_FAIL_Pin|CH6R_1_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOD, PWR_SYSF_Pin|ASYS_F_Pin|PWR_LED_Pin|RLY1_Pin 
                          |Beep_Pin|TESTpb_Pin|MUTEpb_Pin|CH6G_6_Pin 
                          |CH5R_1_Pin|CH4R_4_Pin|CH4R_3_Pin|CH4R_2_Pin 
                          |CH4R_1_Pin|CH3R_4_Pin|CH3R_3_Pin|CH3R_2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOC, CH5G_5_Pin|CH4G_4_Pin|CH3G_3_Pin|CH2G_2_Pin 
                          |CH5R_4_Pin|CH5R_3_Pin|CH5R_2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, CH3R_1_Pin|CH2R_4_Pin|CH2R_3_Pin|CH2R_2_Pin 
                          |CH2R_1_Pin|CH1R_4_Pin|CH1R_3_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pins : CH6R_2_Pin CH6R_3_Pin CH6R_4_Pin CH1R_2_Pin 
                           CH1R_1_Pin */
  GPIO_InitStruct.Pin = CH6R_2_Pin|CH6R_3_Pin|CH6R_4_Pin|CH1R_2_Pin 
                          |CH1R_1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pins : ALLGBYP_7_Pin CH6GBYP_6_Pin CH3_2_Pin CH3_3_Pin 
                           CH3_4_Pin CH4_1_Pin CH4_2_Pin CH4_3_Pin 
                           CH4_4_Pin CH5_1_Pin CH5_2_Pin */
  GPIO_InitStruct.Pin = ALLGBYP_7_Pin|CH6GBYP_6_Pin|CH3_2_Pin|CH3_3_Pin 
                          |CH3_4_Pin|CH4_1_Pin|CH4_2_Pin|CH4_3_Pin 
                          |CH4_4_Pin|CH5_1_Pin|CH5_2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pins : CH5GBYP_5_Pin CH4GBYP_4_Pin CH3GBYP_3_Pin CH2GBYP_2_Pin 
                           CH1GBYP_1_Pin CH2_1_Pin CH2_2_Pin */
  GPIO_InitStruct.Pin = CH5GBYP_5_Pin|CH4GBYP_4_Pin|CH3GBYP_3_Pin|CH2GBYP_2_Pin 
                          |CH1GBYP_1_Pin|CH2_1_Pin|CH2_2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : RSV_Pin CH1_1_Pin CH1_2_Pin CH1_3_Pin 
                           CH1_4_Pin PMUTEPB_Pin BATT_FAIL_Pin AC_FAIL_Pin */
  GPIO_InitStruct.Pin = RSV_Pin|CH1_1_Pin|CH1_2_Pin|CH1_3_Pin 
                          |CH1_4_Pin|PMUTEPB_Pin|BATT_FAIL_Pin|AC_FAIL_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : RTS_Pin CH1G_1_Pin CONN_FAIL_Pin CH6R_1_Pin */
  GPIO_InitStruct.Pin = RTS_Pin|CH1G_1_Pin|CONN_FAIL_Pin|CH6R_1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : CH2_3_Pin CH2_4_Pin CH3_1_Pin CH5_3_Pin 
                           CH5_4_Pin CH6_1_Pin CH6_2_Pin CH6_3_Pin 
                           CH6_4_Pin */
  GPIO_InitStruct.Pin = CH2_3_Pin|CH2_4_Pin|CH3_1_Pin|CH5_3_Pin 
                          |CH5_4_Pin|CH6_1_Pin|CH6_2_Pin|CH6_3_Pin 
                          |CH6_4_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pins : PWR_SYSF_Pin ASYS_F_Pin PWR_LED_Pin RLY1_Pin 
                           Beep_Pin TESTpb_Pin MUTEpb_Pin CH6G_6_Pin 
                           CH5R_1_Pin CH4R_4_Pin CH4R_3_Pin CH4R_2_Pin 
                           CH4R_1_Pin CH3R_4_Pin CH3R_3_Pin CH3R_2_Pin */
  GPIO_InitStruct.Pin = PWR_SYSF_Pin|ASYS_F_Pin|PWR_LED_Pin|RLY1_Pin 
                          |Beep_Pin|TESTpb_Pin|MUTEpb_Pin|CH6G_6_Pin 
                          |CH5R_1_Pin|CH4R_4_Pin|CH4R_3_Pin|CH4R_2_Pin 
                          |CH4R_1_Pin|CH3R_4_Pin|CH3R_3_Pin|CH3R_2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : CH5G_5_Pin CH4G_4_Pin CH3G_3_Pin CH2G_2_Pin 
                           CH5R_4_Pin CH5R_3_Pin CH5R_2_Pin */
  GPIO_InitStruct.Pin = CH5G_5_Pin|CH4G_4_Pin|CH3G_3_Pin|CH2G_2_Pin 
                          |CH5R_4_Pin|CH5R_3_Pin|CH5R_2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

